# Resumo de dados

![alt text](https://joaomrcarvalho.github.io/images/multi-doc-summary-800x638.png)

In [1]:
import pandas as pd
import numpy as np

## A função GroupBy

In [2]:
data = pd.read_csv('../dados/phone_data.csv', index_col='index')

print(data.head(10))
print('-----------------------------------------------------------------------------------------')

print(data.info())

                 date  duration  item    month    network network_type
index
0      15/10/14 06:58    34.429  data  2014-11       data         data
1      15/10/14 06:58    13.000  call  2014-11   Vodafone       mobile
2      15/10/14 14:46    23.000  call  2014-11     Meteor       mobile
3      15/10/14 14:48     4.000  call  2014-11      Tesco       mobile
4      15/10/14 17:27     4.000  call  2014-11      Tesco       mobile
5      15/10/14 18:55     4.000  call  2014-11      Tesco       mobile
6      16/10/14 06:58    34.429  data  2014-11       data         data
7      16/10/14 15:01   602.000  call  2014-11      Three       mobile
8      16/10/14 15:12  1050.000  call  2014-11      Three       mobile
9      16/10/14 15:30    19.000  call  2014-11  voicemail    voicemail
-----------------------------------------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
Int64Index: 830 entries, 0 to 829
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          830 non-null    object
 1   duration      830 non-null    float64
 2   item          830 non-null    object
 3   month         830 non-null    object
 4   network       830 non-null    object
 5   network_type  830 non-null    object
dtypes: float64(1), object(5)
memory usage: 45.4+ KB
None

In [3]:
import dateutil
print(data.head())

data['date'] = data['date'].apply(dateutil.parser.parse, dayfirst=True)
print(data.head(100))

                 date  duration  item    month   network network_type
index
0      15/10/14 06:58    34.429  data  2014-11      data         data
1      15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      15/10/14 17:27     4.000  call  2014-11     Tesco       mobile
                     date  duration  item    month   network network_type
index
0     2014-10-15 06:58:00    34.429  data  2014-11      data         data
1     2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2     2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile
3     2014-10-15 14:48:00     4.000  call  2014-11     Tesco       mobile
4     2014-10-15 17:27:00     4.000  call  2014-11     Tesco       mobile
...                   ...       ...   ...      ...       ...          ...
95    2014-10-29 06:58:00    34.429  data  2014-11      data         data
96    2014-10-29 12:56:00   442.000  call  2014-11  Vodafone       mobile
97    2014-10-30 06:58:00    34.429  data  2014-11      data         data
98    2014-10-30 14:31:00   463.000  call  2014-11  Vodafone       mobile
99    2014-10-30 19:48:00     4.000  call  2014-11  Vodafone       mobile

[100 rows x 6 columns]

In [4]:
group = data.groupby(['month'])

print(group.head)

<bound method GroupBy.head of <pandas.core.groupby.generic.DataFrameGroupBy object at 0x114b2d710>>

In [5]:
print(group.groups.keys())

dict_keys(['2014-11', '2014-12', '2015-01', '2015-02', '2015-03'])

In [6]:
print(group.groups['2014-11'])

print('------------------------------------------------')

print(len(group.groups['2014-11']))

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            220, 221, 222, 223, 224, 225, 226, 227, 229, 230],
           dtype='int64', name='index', length=230)
------------------------------------------------
230

In [7]:
#maximo de cada mês
print(group.max())

print('------------------------------------------------')

print(group.max()['duration'])

                       date  duration item    network network_type
month
2014-11 2014-11-13 22:31:00    1940.0  sms  voicemail    voicemail
2014-12 2014-12-14 19:54:00    2120.0  sms      world        world
2015-01 2015-01-14 23:36:00    1859.0  sms  voicemail    voicemail
2015-02 2015-02-12 06:58:00    1863.0  sms  voicemail    voicemail
2015-03 2015-03-14 00:16:00   10528.0  sms      world        world
------------------------------------------------
month
2014-11     1940.0
2014-12     2120.0
2015-01     1859.0
2015-02     1863.0
2015-03    10528.0
Name: duration, dtype: float64

In [8]:
print(group.first())

                       date  duration  item   network network_type
month
2014-11 2014-10-15 06:58:00    34.429  data      data         data
2014-12 2014-11-13 06:58:00    34.429  data      data         data
2015-01 2014-12-13 06:58:00    34.429  data      data         data
2015-02 2015-01-13 06:58:00    34.429  data      data         data
2015-03 2015-02-12 20:15:00    69.000  call  landline     landline

In [9]:
print(group.sum())

          duration
month
2014-11  26639.441
2014-12  14641.870
2015-01  18223.299
2015-02  15522.299
2015-03  22750.441

In [10]:
group = data.groupby('month').agg({'duration':'sum', 'item':'first', 'network':'last'})

print(group)
print('----------------------------------------------------------------------------')

group = data.groupby('month', as_index=False).agg({'duration':'mean', 'item':'last', 'network':'first'})
print(group)

          duration  item   network
month
2014-11  26639.441  data  Vodafone
2014-12  14641.870  data     Three
2015-01  18223.299  data     Three
2015-02  15522.299  data      data
2015-03  22750.441  call     world
----------------------------------------------------------------------------
     month    duration  item   network
0  2014-11  115.823657   sms      data
1  2014-12   93.260318  call      data
2  2015-01   88.894141   sms      data
3  2015-02  113.301453  data      data
4  2015-03  225.251891   sms  landline

In [11]:
group = data.groupby('month').agg({"duration":['max','mean','sum'] ,"item":'first','network':'last'})

print(group)

        duration                         item   network
             max        mean        sum first      last
month
2014-11   1940.0  115.823657  26639.441  data  Vodafone
2014-12   2120.0   93.260318  14641.870  data     Three
2015-01   1859.0   88.894141  18223.299  data     Three
2015-02   1863.0  113.301453  15522.299  data      data
2015-03  10528.0  225.251891  22750.441  call     world

In [12]:
group = data.groupby(['month','item']).agg({'duration':'sum','network_type':'count','date':['last','nunique']})
print(group)

               duration network_type                date
                    sum        count                last nunique
month   item
2014-11 call  25547.000          107 2014-11-12 19:01:00     104
        data    998.441           29 2014-11-12 06:58:00      29
        sms      94.000           94 2014-11-13 22:31:00      79
2014-12 call  13561.000           79 2014-12-14 19:54:00      76
        data   1032.870           30 2014-12-12 06:58:00      30
        sms      48.000           48 2014-12-07 23:22:00      41
2015-01 call  17070.000           88 2015-01-14 20:47:00      84
        data   1067.299           31 2015-01-12 06:58:00      31
        sms      86.000           86 2015-01-14 23:36:00      58
2015-02 call  14416.000           67 2015-02-09 17:54:00      67
        data   1067.299           31 2015-02-12 06:58:00      31
        sms      39.000           39 2015-02-10 21:40:00      27
2015-03 call  21727.000           47 2015-03-04 12:29:00      47
        data    998.441           29 2015-03-13 06:58:00      29
        sms      25.000           25 2015-03-14 00:16:00      17

In [13]:
group = data.groupby('month', as_index=False).agg({"duration":['max','mean','sum'] ,"item":'first','network':'last'})
print(group)

     month duration                         item   network
                max        mean        sum first      last
0  2014-11   1940.0  115.823657  26639.441  data  Vodafone
1  2014-12   2120.0   93.260318  14641.870  data     Three
2  2015-01   1859.0   88.894141  18223.299  data     Three
3  2015-02   1863.0  113.301453  15522.299  data      data
4  2015-03  10528.0  225.251891  22750.441  call     world

In [14]:
print(group)
group.columns = group.columns.droplevel(level=0)

print('----------------------------------------------------------------------------------------------')
print(group)
print('----------------------------------------------------------------------------------------------')

group.rename(columns={ 'max':'max_duration','mean':'mean_duration','sum':'sum_duration'}, inplace=True)
print(group)

     month duration                         item   network
                max        mean        sum first      last
0  2014-11   1940.0  115.823657  26639.441  data  Vodafone
1  2014-12   2120.0   93.260318  14641.870  data     Three
2  2015-01   1859.0   88.894141  18223.299  data     Three
3  2015-02   1863.0  113.301453  15522.299  data      data
4  2015-03  10528.0  225.251891  22750.441  call     world
----------------------------------------------------------------------------------------------
                max        mean        sum first      last
0  2014-11   1940.0  115.823657  26639.441  data  Vodafone
1  2014-12   2120.0   93.260318  14641.870  data     Three
2  2015-01   1859.0   88.894141  18223.299  data     Three
3  2015-02   1863.0  113.301453  15522.299  data      data
4  2015-03  10528.0  225.251891  22750.441  call     world
----------------------------------------------------------------------------------------------
            max_duration  mean_duration  sum_duration first      last
0  2014-11        1940.0     115.823657     26639.441  data  Vodafone
1  2014-12        2120.0      93.260318     14641.870  data     Three
2  2015-01        1859.0      88.894141     18223.299  data     Three
3  2015-02        1863.0     113.301453     15522.299  data      data
4  2015-03       10528.0     225.251891     22750.441  call     world

In [15]:
group = data.groupby('month', as_index=False).agg({'duration':['max','mean','sum'] ,'item':['first','last'],'network':'last'})

print(group)
print('--------------------------------------------------------------------------------------------------')

print(group.columns.ravel())

print('--------------------------------------------------------------------------------------------------')

group.columns = ["_".join(x) for x in group.columns.ravel()]
print(group)

     month duration                         item         network
                max        mean        sum first  last      last
0  2014-11   1940.0  115.823657  26639.441  data   sms  Vodafone
1  2014-12   2120.0   93.260318  14641.870  data  call     Three
2  2015-01   1859.0   88.894141  18223.299  data   sms     Three
3  2015-02   1863.0  113.301453  15522.299  data  data      data
4  2015-03  10528.0  225.251891  22750.441  call   sms     world
--------------------------------------------------------------------------------------------------
[('month', '') ('duration', 'max') ('duration', 'mean')
 ('duration', 'sum') ('item', 'first') ('item', 'last')
 ('network', 'last')]
--------------------------------------------------------------------------------------------------
    month_  duration_max  duration_mean  duration_sum item_first item_last  \
0  2014-11        1940.0     115.823657     26639.441       data       sms
1  2014-12        2120.0      93.260318     14641.870       data      call
2  2015-01        1859.0      88.894141     18223.299       data       sms
3  2015-02        1863.0     113.301453     15522.299       data      data
4  2015-03       10528.0     225.251891     22750.441       call       sms

  network_last
0     Vodafone
1        Three
2        Three
3         data
4        world

**Sugestão de exercício:** Gerar um novo DataFrame a partir do conjunto de dados adults, agrupado por idade e aplicar-lhe as operações sum, min e max em três colunas distintas. No final, organizar os dados de forma intuitiva.

In [16]:
# Resolução

## Combinar Múltiplos DataFrames

In [17]:
data = pd.read_csv('../dados/iris.data',names=['x1','x2','x3','x4','especie'])
print(data.head())

    x1   x2   x3   x4      especie
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

### Concatenar DataFrames

In [18]:
first_10 = data.head(10)
print(first_10)

print('--------------------------------------------------------')

last_10 = data.tail(10)
print(last_10)

print('--------------------------------------------------------')

last_10 = last_10.reset_index(drop=True) 
print(last_10)

    x1   x2   x3   x4      especie
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa
5  5.4  3.9  1.7  0.4  Iris-setosa
6  4.6  3.4  1.4  0.3  Iris-setosa
7  5.0  3.4  1.5  0.2  Iris-setosa
8  4.4  2.9  1.4  0.2  Iris-setosa
9  4.9  3.1  1.5  0.1  Iris-setosa
--------------------------------------------------------
      x1   x2   x3   x4         especie
140  6.7  3.1  5.6  2.4  Iris-virginica
141  6.9  3.1  5.1  2.3  Iris-virginica
142  5.8  2.7  5.1  1.9  Iris-virginica
143  6.8  3.2  5.9  2.3  Iris-virginica
144  6.7  3.3  5.7  2.5  Iris-virginica
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica
--------------------------------------------------------
    x1   x2   x3   x4         especie
0  6.7  3.1  5.6  2.4  Iris-virginica
1  6.9  3.1  5.1  2.3  Iris-virginica
2  5.8  2.7  5.1  1.9  Iris-virginica
3  6.8  3.2  5.9  2.3  Iris-virginica
4  6.7  3.3  5.7  2.5  Iris-virginica
5  6.7  3.0  5.2  2.3  Iris-virginica
6  6.3  2.5  5.0  1.9  Iris-virginica
7  6.5  3.0  5.2  2.0  Iris-virginica
8  6.2  3.4  5.4  2.3  Iris-virginica
9  5.9  3.0  5.1  1.8  Iris-virginica

In [19]:
concat_vertical = pd.concat([first_10,last_10], axis=0)
print(concat_vertical)

print('-----------------------------------------------------------------------------')

concat_horizontal = pd.concat([first_10,last_10], axis=1)
print(concat_horizontal)

    x1   x2   x3   x4         especie
0  5.1  3.5  1.4  0.2     Iris-setosa
1  4.9  3.0  1.4  0.2     Iris-setosa
2  4.7  3.2  1.3  0.2     Iris-setosa
3  4.6  3.1  1.5  0.2     Iris-setosa
4  5.0  3.6  1.4  0.2     Iris-setosa
5  5.4  3.9  1.7  0.4     Iris-setosa
6  4.6  3.4  1.4  0.3     Iris-setosa
7  5.0  3.4  1.5  0.2     Iris-setosa
8  4.4  2.9  1.4  0.2     Iris-setosa
9  4.9  3.1  1.5  0.1     Iris-setosa
0  6.7  3.1  5.6  2.4  Iris-virginica
1  6.9  3.1  5.1  2.3  Iris-virginica
2  5.8  2.7  5.1  1.9  Iris-virginica
3  6.8  3.2  5.9  2.3  Iris-virginica
4  6.7  3.3  5.7  2.5  Iris-virginica
5  6.7  3.0  5.2  2.3  Iris-virginica
6  6.3  2.5  5.0  1.9  Iris-virginica
7  6.5  3.0  5.2  2.0  Iris-virginica
8  6.2  3.4  5.4  2.3  Iris-virginica
9  5.9  3.0  5.1  1.8  Iris-virginica
-----------------------------------------------------------------------------
    x1   x2   x3   x4      especie   x1   x2   x3   x4         especie
0  5.1  3.5  1.4  0.2  Iris-setosa  6.7  3.1  5.6  2.4  Iris-virginica
1  4.9  3.0  1.4  0.2  Iris-setosa  6.9  3.1  5.1  2.3  Iris-virginica
2  4.7  3.2  1.3  0.2  Iris-setosa  5.8  2.7  5.1  1.9  Iris-virginica
3  4.6  3.1  1.5  0.2  Iris-setosa  6.8  3.2  5.9  2.3  Iris-virginica
4  5.0  3.6  1.4  0.2  Iris-setosa  6.7  3.3  5.7  2.5  Iris-virginica
5  5.4  3.9  1.7  0.4  Iris-setosa  6.7  3.0  5.2  2.3  Iris-virginica
6  4.6  3.4  1.4  0.3  Iris-setosa  6.3  2.5  5.0  1.9  Iris-virginica
7  5.0  3.4  1.5  0.2  Iris-setosa  6.5  3.0  5.2  2.0  Iris-virginica
8  4.4  2.9  1.4  0.2  Iris-setosa  6.2  3.4  5.4  2.3  Iris-virginica
9  4.9  3.1  1.5  0.1  Iris-setosa  5.9  3.0  5.1  1.8  Iris-virginica

In [20]:
print(list(concat_vertical.index))

print('--------------------------------------------------------------------')

concat_vertical = pd.concat([first_10,last_10],axis=0,ignore_index=True)
print(list(concat_vertical.index))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
--------------------------------------------------------------------
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19]

**Sugestão de exercício:** Renomear as colunas do dataframe last_10, eliminar a coluna relativa à espécie e concatenar com o dataframe first_10.

### A função  pd.merge

In [21]:
df_1 = pd.DataFrame({'index_1':[1,2,3,4,6,7,9,10],
                     'nomes':['joão','alexandre','andré','ana','bernardo','cláudia','rodrigo','maria'],
                     'altura':[1.6,1.8,1.7,1.75,1.88,2.1,1.87,1.65]})

df_2 = pd.DataFrame({'index_2':[1,2,3,4,5,6,7,8],
                     'peso':[84,102,63,79,90,110,87,59]})

In [22]:
merged_inner = pd.merge(left=df_1,right=df_2, left_on='index_1', right_on='index_2',how='inner')

print(merged_inner)

   index_1      nomes  altura  index_2  peso
0        1       joão    1.60        1    84
1        2  alexandre    1.80        2   102
2        3      andré    1.70        3    63
3        4        ana    1.75        4    79
4        6   bernardo    1.88        6   110
5        7    cláudia    2.10        7    87

In [23]:
merged_outer = pd.merge(left=df_1,right=df_2, left_on='index_1', right_on='index_2',how='outer')

print(merged_outer)

   index_1      nomes  altura  index_2   peso
0      1.0       joão    1.60      1.0   84.0
1      2.0  alexandre    1.80      2.0  102.0
2      3.0      andré    1.70      3.0   63.0
3      4.0        ana    1.75      4.0   79.0
4      6.0   bernardo    1.88      6.0  110.0
5      7.0    cláudia    2.10      7.0   87.0
6      9.0    rodrigo    1.87      NaN    NaN
7     10.0      maria    1.65      NaN    NaN
8      NaN        NaN     NaN      5.0   90.0
9      NaN        NaN     NaN      8.0   59.0

In [24]:
merged_left = pd.merge(left=df_1,right=df_2, left_on='index_1', right_on='index_2',how='left')

print(merged_left)

print("----------------------------------------------------------------------------------------------------")

merged_right = pd.merge(left=df_1,right=df_2, left_on='index_1', right_on='index_2',how='right')

print(merged_right)

   index_1      nomes  altura  index_2   peso
0        1       joão    1.60      1.0   84.0
1        2  alexandre    1.80      2.0  102.0
2        3      andré    1.70      3.0   63.0
3        4        ana    1.75      4.0   79.0
4        6   bernardo    1.88      6.0  110.0
5        7    cláudia    2.10      7.0   87.0
6        9    rodrigo    1.87      NaN    NaN
7       10      maria    1.65      NaN    NaN
----------------------------------------------------------------------------------------------------
   index_1      nomes  altura  index_2  peso
0      1.0       joão    1.60        1    84
1      2.0  alexandre    1.80        2   102
2      3.0      andré    1.70        3    63
3      4.0        ana    1.75        4    79
4      6.0   bernardo    1.88        6   110
5      7.0    cláudia    2.10        7    87
6      NaN        NaN     NaN        5    90
7      NaN        NaN     NaN        8    59

## A tabela Pivot

In [25]:
# !pip install xlrd

data = pd.read_excel('../dados/sales-funnel.xlsx')
print(data.head())

   Account                          Name            Rep       Manager  \
0   714466               Trantow-Barrows   Craig Booker  Debra Henley
1   714466               Trantow-Barrows   Craig Booker  Debra Henley
2   714466               Trantow-Barrows   Craig Booker  Debra Henley
3   737550  Fritsch, Russel and Anderson   Craig Booker  Debra Henley
4   146832                  Kiehn-Spinka  Daniel Hilton  Debra Henley

       Product  Quantity  Price     Status
0          CPU         1  30000  presented
1     Software         1  10000  presented
2  Maintenance         2   5000    pending
3          CPU         1  35000   declined
4          CPU         2  65000        won

In [26]:
pvt_table = pd.pivot_table(data, index=['Name'])

print(pvt_table)

                              Account   Price  Quantity
Name
Barton LLC                     740150   35000  1.000000
Fritsch, Russel and Anderson   737550   35000  1.000000
Herman LLC                     141962   65000  2.000000
Jerde-Hilpert                  412290    5000  2.000000
Kassulke, Ondricka and Metz    307599    7000  3.000000
Keeling LLC                    688981  100000  5.000000
Kiehn-Spinka                   146832   65000  2.000000
Koepp Ltd                      729833   35000  2.000000
Kulas Inc                      218895   25000  1.500000
Purdy-Kunde                    163416   30000  1.000000
Stokes LLC                     239344    7500  1.000000
Trantow-Barrows                714466   15000  1.333333

In [27]:
pvt_table = pd.pivot_table(data,index=['Name'],values=['Price'])

print(pvt_table.head())

                              Price
Name
Barton LLC                    35000
Fritsch, Russel and Anderson  35000
Herman LLC                    65000
Jerde-Hilpert                  5000
Kassulke, Ondricka and Metz    7000

In [28]:
pvt_table = pd.pivot_table(data,index=['Rep','Name'])

print(pvt_table)

print('----------------------------------------------------------------------------------------------------------')

pvt_table = pd.pivot_table(data,index=['Name','Rep'])

print(pvt_table)

                                            Account   Price  Quantity
Rep           Name
Cedric Moss   Herman LLC                     141962   65000  2.000000
              Purdy-Kunde                    163416   30000  1.000000
              Stokes LLC                     239344    7500  1.000000
Craig Booker  Fritsch, Russel and Anderson   737550   35000  1.000000
              Trantow-Barrows                714466   15000  1.333333
Daniel Hilton Kiehn-Spinka                   146832   65000  2.000000
              Kulas Inc                      218895   25000  1.500000
John Smith    Barton LLC                     740150   35000  1.000000
              Jerde-Hilpert                  412290    5000  2.000000
Wendy Yule    Kassulke, Ondricka and Metz    307599    7000  3.000000
              Keeling LLC                    688981  100000  5.000000
              Koepp Ltd                      729833   35000  2.000000
----------------------------------------------------------------------------------------------------------
                                            Account   Price  Quantity
Name                         Rep
Barton LLC                   John Smith      740150   35000  1.000000
Fritsch, Russel and Anderson Craig Booker    737550   35000  1.000000
Herman LLC                   Cedric Moss     141962   65000  2.000000
Jerde-Hilpert                John Smith      412290    5000  2.000000
Kassulke, Ondricka and Metz  Wendy Yule      307599    7000  3.000000
Keeling LLC                  Wendy Yule      688981  100000  5.000000
Kiehn-Spinka                 Daniel Hilton   146832   65000  2.000000
Koepp Ltd                    Wendy Yule      729833   35000  2.000000
Kulas Inc                    Daniel Hilton   218895   25000  1.500000
Purdy-Kunde                  Cedric Moss     163416   30000  1.000000
Stokes LLC                   Cedric Moss     239344    7500  1.000000
Trantow-Barrows              Craig Booker    714466   15000  1.333333

In [54]:
pvt_table = pd.pivot_table(data,index=["Rep","Name","Product"],values=["Price","Quantity"])
print(pvt_table)

                                                         Price  Quantity
Rep           Name                         Product
Cedric Moss   Herman LLC                   CPU           65000         2
              Purdy-Kunde                  CPU           30000         1
              Stokes LLC                   Maintenance    5000         1
                                           Software      10000         1
Craig Booker  Fritsch, Russel and Anderson CPU           35000         1
              Trantow-Barrows              CPU           30000         1
                                           Maintenance    5000         2
                                           Software      10000         1
Daniel Hilton Kiehn-Spinka                 CPU           65000         2
              Kulas Inc                    CPU           40000         2
                                           Software      10000         1
John Smith    Barton LLC                   CPU           35000         1
              Jerde-Hilpert                Maintenance    5000         2
Wendy Yule    Kassulke, Ondricka and Metz  Maintenance    7000         3
              Keeling LLC                  CPU          100000         5
              Koepp Ltd                    CPU           65000         2
                                           Monitor        5000         2

In [55]:
rep = pvt_table.loc['Cedric Moss']

print(rep)

#resolução

Cedric Moss
Craig Booker
Daniel Hilton
John Smith
Wendy Yule

**Sugestão de exercício:** Salvar as subtabelas em arquivos independentes no formato excel.

In [57]:
pvt_table = pd.pivot_table(data,index=["Manager","Rep"],values=["Price"],aggfunc=['sum'])

print(pvt_table)

print('-----------------------------------------------------------------------------------------------------')

pvt_table = pd.pivot_table(data,index=["Manager","Rep"],values=["Price"],aggfunc=['sum','mean'])

print(pvt_table)

                                sum
                              Price
Manager       Rep
Debra Henley  Craig Booker    80000
              Daniel Hilton  115000
              John Smith      40000
Fred Anderson Cedric Moss    110000
              Wendy Yule     177000
-----------------------------------------------------------------------------------------------------
                                sum          mean
                              Price         Price
Manager       Rep
Debra Henley  Craig Booker    80000  20000.000000
              Daniel Hilton  115000  38333.333333
              John Smith      40000  20000.000000
Fred Anderson Cedric Moss    110000  27500.000000
              Wendy Yule     177000  44250.000000

In [58]:
pvt_table = pd.pivot_table(data,index=["Manager","Rep"],values=["Price"],aggfunc=['sum'],columns=['Product'])

print(pvt_table)

                                  sum
                                Price
Product                           CPU Maintenance Monitor Software
Manager       Rep
Debra Henley  Craig Booker    65000.0      5000.0     NaN  10000.0
              Daniel Hilton  105000.0         NaN     NaN  10000.0
              John Smith      35000.0      5000.0     NaN      NaN
Fred Anderson Cedric Moss     95000.0      5000.0     NaN  10000.0
              Wendy Yule     165000.0      7000.0  5000.0      NaN

In [33]:
pvt_table = pd.pivot_table(data,index=["Manager","Rep"],values=["Price"],aggfunc=['sum'],columns=['Product'],
                          fill_value=0)

print(pvt_table)

                                sum
                              Price
Product                         CPU Maintenance Monitor Software
Manager       Rep
Debra Henley  Craig Booker    65000        5000       0    10000
              Daniel Hilton  105000           0       0    10000
              John Smith      35000        5000       0        0
Fred Anderson Cedric Moss     95000        5000       0    10000
              Wendy Yule     165000        7000    5000        0

In [34]:
pvt_table = pd.pivot_table(data,index=["Manager","Rep"],values=["Price"],aggfunc=['sum','mean'],columns=['Product'],
                          fill_value=0)

pvt_table

                                sum                                mean  \
                              Price                               Price
Product                         CPU Maintenance Monitor Software    CPU
Manager       Rep
Debra Henley  Craig Booker    65000        5000       0    10000  32500
              Daniel Hilton  105000           0       0    10000  52500
              John Smith      35000        5000       0        0  35000
Fred Anderson Cedric Moss     95000        5000       0    10000  47500
              Wendy Yule     165000        7000    5000        0  82500



Product                     Maintenance Monitor Software
Manager       Rep
Debra Henley  Craig Booker         5000       0    10000
              Daniel Hilton           0       0    10000
              John Smith           5000       0        0
Fred Anderson Cedric Moss          5000       0    10000
              Wendy Yule           7000    5000        0

In [35]:
pvt_table = pd.pivot_table(data,index=["Manager","Rep","Product"],values=["Price"],aggfunc=['sum','mean'],
                          fill_value=0)
pvt_table

                                            sum   mean
                                          Price  Price
Manager       Rep           Product
Debra Henley  Craig Booker  CPU           65000  32500
                            Maintenance    5000   5000
                            Software      10000  10000
              Daniel Hilton CPU          105000  52500
                            Software      10000  10000
              John Smith    CPU           35000  35000
                            Maintenance    5000   5000
Fred Anderson Cedric Moss   CPU           95000  47500
                            Maintenance    5000   5000
                            Software      10000  10000
              Wendy Yule    CPU          165000  82500
                            Maintenance    7000   7000
                            Monitor        5000   5000

## O padrão split-apply-combine

In [36]:
fic_data = pd.DataFrame({'size':['GG','G','M','P','GG','G','M','P','GG','G','M','P','GG','G','M','P','M','P'],
            'sale':[1000,1500,800,900,2000,1450,1200,3000,2500,2000,1600,900,901,1500,1420,1300,4000,3500],
            'transaction':[50,75,410,460,115,60,35,125,125,55,65,430,490,150,85,115,140,80],
             'type':['D','D','D','D','D','D','D','D','D','B','B','B','B','B','B','B','B','B']})

print(fic_data.head())

  size  sale  transaction type
0   GG  1000           50    D
1    G  1500           75    D
2    M   800          410    D
3    P   900          460    D
4   GG  2000          115    D

### Split

In [60]:
gp_data = fic_data.groupby('size')

gp_data.get_group('G')

   size  sale  transaction type
1     G  1500           75    D
5     G  1450           60    D
9     G  2000           55    B
13    G  1500          150    B

In [66]:
for key,value in gp_data:
    print('Grupo',key)
    print(value)
    print('-------------------')

Grupo G
   size  sale  transaction type
1     G  1500           75    D
5     G  1450           60    D
9     G  2000           55    B
13    G  1500          150    B
-------------------
Grupo GG
   size  sale  transaction type
0    GG  1000           50    D
4    GG  2000          115    D
8    GG  2500          125    D
12   GG   901          490    B
-------------------
Grupo M
   size  sale  transaction type
2     M   800          410    D
6     M  1200           35    D
10    M  1600           65    B
14    M  1420           85    B
16    M  4000          140    B
-------------------
Grupo P
   size  sale  transaction type
3     P   900          460    D
7     P  3000          125    D
11    P   900          430    B
15    P  1300          115    B
17    P  3500           80    B
-------------------

In [39]:
sub_gp_data = gp_data.get_group('G').groupby('type')

sub_gp_data.mean()

        sale  transaction
type
B     1750.0        102.5
D     1475.0         67.5

### Apply

In [40]:
gp_data = fic_data.groupby(['type','size'], as_index=True).agg({'sale':['sum','mean']})


print(gp_data)

print('--------------------------------------------------------')

gp_data = fic_data.groupby(['type','size'], as_index=False).agg({'sale':['sum','mean']})

print(gp_data)

           sale
            sum         mean
type size
B    G     3500  1750.000000
     GG     901   901.000000
     M     7020  2340.000000
     P     5700  1900.000000
D    G     2950  1475.000000
     GG    5500  1833.333333
     M     2000  1000.000000
     P     3900  1950.000000
--------------------------------------------------------
  type size  sale
              sum         mean
0    B    G  3500  1750.000000
1    B   GG   901   901.000000
2    B    M  7020  2340.000000
3    B    P  5700  1900.000000
4    D    G  2950  1475.000000
5    D   GG  5500  1833.333333
6    D    M  2000  1000.000000
7    D    P  3900  1950.000000

In [41]:
f = lambda x: 'high' if x > 3000 else 'low'


gp_data = fic_data.groupby(['type','size'], as_index=False).agg({'sale':['sum','mean']})
print(gp_data)

print("-----------------------------------------")

gp_data['level'] = gp_data['sale']['sum'].apply(f)
print(gp_data)

  type size  sale
              sum         mean
0    B    G  3500  1750.000000
1    B   GG   901   901.000000
2    B    M  7020  2340.000000
3    B    P  5700  1900.000000
4    D    G  2950  1475.000000
5    D   GG  5500  1833.333333
6    D    M  2000  1000.000000
7    D    P  3900  1950.000000
-----------------------------------------
  type size  sale              level
              sum         mean
0    B    G  3500  1750.000000  high
1    B   GG   901   901.000000   low
2    B    M  7020  2340.000000  high
3    B    P  5700  1900.000000  high
4    D    G  2950  1475.000000   low
5    D   GG  5500  1833.333333  high
6    D    M  2000  1000.000000   low
7    D    P  3900  1950.000000  high

In [42]:
gp_data.columns = ["_".join(x) for x in gp_data.columns.ravel()]

print(gp_data)

print('------------------------------------------------------------------')

lv_gp_data = gp_data.groupby('level_')

print(lv_gp_data.get_group('low'))

  type_ size_  sale_sum    sale_mean level_
0     B     G      3500  1750.000000   high
1     B    GG       901   901.000000    low
2     B     M      7020  2340.000000   high
3     B     P      5700  1900.000000   high
4     D     G      2950  1475.000000    low
5     D    GG      5500  1833.333333   high
6     D     M      2000  1000.000000    low
7     D     P      3900  1950.000000   high
------------------------------------------------------------------
  type_ size_  sale_sum  sale_mean level_
1     B    GG       901      901.0    low
4     D     G      2950     1475.0    low
6     D     M      2000     1000.0    low

In [67]:
fic_data = pd.DataFrame({'size':['GG','G','M','P','GG','G','M','P','GG','G','M','P','GG','G','M','P','M','P'],
            'sale':[1000,1500,800,900,2000,1450,1200,3000,2500,2000,1600,900,901,1500,1420,1300,4000,3500],
            'transaction':[50,75,410,460,115,60,35,125,125,55,65,430,490,150,85,115,140,80],
             'type':['D','D','D','D','D','D','D','D','D','B','B','B','B','B','B','B','B','B']})


print(fic_data.head(5))

print('--------------------------------------------------------------------')

print(fic_data.groupby('type', as_index=True).std())

print('--------------------------------------------------------------------')

fic_data['sale_std'] = fic_data.groupby('type', as_index=True)['sale'].transform('std')

print(fic_data)

  size  sale  transaction type
0   GG  1000           50    D
1    G  1500           75    D
2    M   800          410    D
3    P   900          460    D
4   GG  2000          115    D
--------------------------------------------------------------------
             sale  transaction
type
B     1107.833020   163.244023
D      759.294263   158.863149
--------------------------------------------------------------------
   size  sale  transaction type     sale_std
0    GG  1000           50    D   759.294263
1     G  1500           75    D   759.294263
2     M   800          410    D   759.294263
3     P   900          460    D   759.294263
4    GG  2000          115    D   759.294263
5     G  1450           60    D   759.294263
6     M  1200           35    D   759.294263
7     P  3000          125    D   759.294263
8    GG  2500          125    D   759.294263
9     G  2000           55    B  1107.833020
10    M  1600           65    B  1107.833020
11    P   900          430    B  1107.833020
12   GG   901          490    B  1107.833020
13    G  1500          150    B  1107.833020
14    M  1420           85    B  1107.833020
15    P  1300          115    B  1107.833020
16    M  4000          140    B  1107.833020
17    P  3500           80    B  1107.833020

In [44]:
fic_data = pd.DataFrame({'size':['GG','G','M','P','GG','G','M','P','GG','G','M','P','GG','G','M','P','M','P'],
            'sale':[1000,1500,800,900,2000,1450,1200,3000,2500,2000,1600,900,901,1500,1420,1300,4000,3500],
            'transaction':[50,75,410,460,115,60,35,125,125,55,65,430,490,150,85,115,140,80],
             'type':['D','D','D','D','D','D','D','D','D','B','B','B','B','B','B','B','B','B']})

transformacoes = ['std','sum','mean','count']

for trans in transformacoes:
    fic_data['sale_{}'.format(trans)] = fic_data.groupby(['type','size'], as_index=True)['sale'].transform(trans)
    
print(fic_data)

   size  sale  transaction type     sale_std  sale_sum    sale_mean  \
0    GG  1000           50    D   763.762616      5500  1833.333333
1     G  1500           75    D    35.355339      2950  1475.000000
2     M   800          410    D   282.842712      2000  1000.000000
3     P   900          460    D  1484.924240      3900  1950.000000
4    GG  2000          115    D   763.762616      5500  1833.333333
5     G  1450           60    D    35.355339      2950  1475.000000
6     M  1200           35    D   282.842712      2000  1000.000000
7     P  3000          125    D  1484.924240      3900  1950.000000
8    GG  2500          125    D   763.762616      5500  1833.333333
9     G  2000           55    B   353.553391      3500  1750.000000
10    M  1600           65    B  1440.416606      7020  2340.000000
11    P   900          430    B  1400.000000      5700  1900.000000
12   GG   901          490    B          NaN       901   901.000000
13    G  1500          150    B   353.553391      3500  1750.000000
14    M  1420           85    B  1440.416606      7020  2340.000000
15    P  1300          115    B  1400.000000      5700  1900.000000
16    M  4000          140    B  1440.416606      7020  2340.000000
17    P  3500           80    B  1400.000000      5700  1900.000000

    sale_count
0            3
1            2
2            2
3            2
4            3
5            2
6            2
7            2
8            3
9            2
10           3
11           3
12           1
13           2
14           3
15           3
16           3
17           3

In [45]:
fic_data['sale_stdartized'] = ((fic_data['sale'] - fic_data['sale_mean'])/fic_data['sale_std'])

print(fic_data)

   size  sale  transaction type     sale_std  sale_sum    sale_mean  \
0    GG  1000           50    D   763.762616      5500  1833.333333
1     G  1500           75    D    35.355339      2950  1475.000000
2     M   800          410    D   282.842712      2000  1000.000000
3     P   900          460    D  1484.924240      3900  1950.000000
4    GG  2000          115    D   763.762616      5500  1833.333333
5     G  1450           60    D    35.355339      2950  1475.000000
6     M  1200           35    D   282.842712      2000  1000.000000
7     P  3000          125    D  1484.924240      3900  1950.000000
8    GG  2500          125    D   763.762616      5500  1833.333333
9     G  2000           55    B   353.553391      3500  1750.000000
10    M  1600           65    B  1440.416606      7020  2340.000000
11    P   900          430    B  1400.000000      5700  1900.000000
12   GG   901          490    B          NaN       901   901.000000
13    G  1500          150    B   353.553391      3500  1750.000000
14    M  1420           85    B  1440.416606      7020  2340.000000
15    P  1300          115    B  1400.000000      5700  1900.000000
16    M  4000          140    B  1440.416606      7020  2340.000000
17    P  3500           80    B  1400.000000      5700  1900.000000

    sale_count  sale_stdartized
0            3        -1.091089
1            2         0.707107
2            2        -0.707107
3            2        -0.707107
4            3         0.218218
5            2        -0.707107
6            2         0.707107
7            2         0.707107
8            3         0.872872
9            2         0.707107
10           3        -0.513740
11           3        -0.714286
12           1              NaN
13           2        -0.707107
14           3        -0.638704
15           3        -0.428571
16           3         1.152444
17           3         1.142857

In [46]:
fic_data = pd.DataFrame({'size':['GG','G','M','P','GG','G','M','P','GG','G','M','P','GG','G','M','P','M','P'],
            'sale':[1000,1500,800,900,2000,1450,1200,3000,2500,2000,1600,900,901,1500,1420,1300,4000,3500],
            'transaction':[50,75,410,460,115,60,35,125,125,55,65,430,490,150,85,115,140,80],
             'type':['D','D','D','D','D','D','D','D','D','B','B','B','B','B','B','B','B','B']})


group_data = fic_data.groupby('size')

print(group_data['transaction'].mean())

print('-----------------------------------------------------------------------------------------------')

mean_dic = {
           'P':group_data['transaction'].mean().loc['P'],
           'M':group_data['transaction'].mean().loc['M'],
           'G':group_data['transaction'].mean().loc['G'],
           'GG':group_data['transaction'].mean().loc['GG']
            }


fill_data = pd.DataFrame(columns=fic_data.columns)

for key, group in group_data:
    seleccao = group[group['transaction'] > mean_dic[key]]
    fill_data = fill_data.append(seleccao)
    

print(fill_data)

size
G      85
GG    195
M     147
P     242
Name: transaction, dtype: int64
-----------------------------------------------------------------------------------------------
   size  sale transaction type
13    G  1500         150    B
12   GG   901         490    B
2     M   800         410    D
3     P   900         460    D
11    P   900         430    B

### Combine

In [47]:
group = fic_data.groupby('size',as_index=True)['sale'].mean()

print(type(group))

print(group)

<class 'pandas.core.series.Series'>
size
G     1612.50
GG    1600.25
M     1804.00
P     1920.00
Name: sale, dtype: float64

In [48]:
group = fic_data.groupby('size',as_index=True).agg({'sale':np.mean,'transaction':np.sum})

print(group)

         sale  transaction
size
G     1612.50          340
GG    1600.25          780
M     1804.00          735
P     1920.00         1210

In [49]:
group = fic_data.groupby('size',as_index=False)['sale'].mean()

print(group)

  size     sale
0    G  1612.50
1   GG  1600.25
2    M  1804.00
3    P  1920.00